CoreMaker-lab/RA4M2_IOT/RA4M2_IOT_Project9/src/hal_entry.c
// Tap 检测主循环函数：用于持续检测并打印单击/双击事件
static void sensor_lsm6dsv16x_tap_loop(void)
{
    // 若外部中断触发，读取传感器中断源
    if (irq_flag)
    {
        wifi_Update=1;
        g_tuya_up_data=2000;
        lsm6dsv16x_all_sources_get(&dev_ctx, &status);
        irq_flag = false;

        if (status.single_tap)
            stap_event_catched = 1;

        if (status.double_tap)
            dtap_event_catched = 1;
        }

        // 若捕获到单击事件，处理并打印
        if (stap_event_catched)
        {
            stap_event_catched = 0;
            up_down=1;
            printf("Single TAP\r\n");
        }

        // 若捕获到双击事件，处理并打印
        if (dtap_event_catched)
        {
            dtap_event_catched = 0;
            up_down=2;
            printf("Double TAP\r\n");
        }
}

/*******************************************************************************************************************
 * @brief 向涂鸦模块上报最新 DP 数据 & 本地硬件同步
 *******************************************************************************************************************/
static void tuya_wifi_Update(void)
{
    if(wifi_Update)
    {
        printf("wifi_Update\n");
        wifi_Update=0;

        g_tuya_dp_tap[10]=up_down;//状态
        g_tuya_dp_tap[11]=0;//校验和
        for(int i=0;i<=10;i++)
            g_tuya_dp_tap[11]+=g_tuya_dp_tap[i];
        err = R_SCI_UART_Write(&g_uart0_ctrl, g_tuya_dp_tap, 12);
        if(FSP_SUCCESS != err) __BKPT();
        while(uart_wifi_TX_flag == false){}
        uart_wifi_TX_flag = false;

    }

}

/*******************************************************************************************************************
 * @brief 长按按键 3 s 进入配网模式 (发送 0x05 命令)
 *******************************************************************************************************************/
static void button_wifi_ap(void)
{
    //  wifi_ap_num
    bsp_io_level_t p_port_value_pin_111;
    R_IOPORT_PinRead(&g_ioport_ctrl, BSP_IO_PORT_01_PIN_11, &p_port_value_pin_111);
    if(p_port_value_pin_111)/* 松开 */
        wifi_ap_num=0;
    else//长按3s复位wifi
    {
        if(wifi_ap_num<3000)
            wifi_ap_num++;
        else if(wifi_ap_num==3000)
        {
            g_oled_clear=1;// 切屏前清屏
            g_oled_page=0;// 0-Tuya 1-MEMS 2-Baro

            wifi_ap_num++;
            printf("[BTN] wifi_ap_mode\r\n");
            fsp_err_t err = R_SCI_UART_Write(&g_uart0_ctrl, g_tuya_wifi_cfg, 8);
            if(FSP_SUCCESS != err) __BKPT();
            while(uart_wifi_TX_flag == false){}
            uart_wifi_TX_flag = false;
        }

        if(wifi_ap_num==100)//轻触切换OLED显示
        {
            g_oled_clear=1;// 下一帧先清屏
            if(g_oled_page<2)// 0-Tuya 1-MEMS 2-Baro
                g_oled_page++;
            else
                g_oled_page=0;

        }

    }
}

/*******************************************************************************************************************
 * @brief 解析完成后，根据 CMD 打印清晰友好的日志
 *******************************************************************************************************************/
static void uart0_tuya(void)
{
    if(UART0_TUYA_flag ==1)//接收完成标志
    {

        fsp_err_t err = FSP_SUCCESS;
        UART0_TUYA_flag=0;
        if(TUYA_wifi_buffer[0]==0x55&&TUYA_wifi_buffer[1]==0xAA)//判断帧头和版本
        {
            if(TUYA_wifi_buffer[3]==0x00)//判断是否为心跳检测
            {
                printf("[TUYA] <heartbeat(SEQ=%u)\r\n", wifi_first);
//                if(wifi_num<2000&&wifi_first==1)//频繁发送心跳指令，认为重启
//                {
//                    wifi_first=0;
//                   }
//                wifi_num=0;
                if(wifi_first==0)//第一次发送心跳数据
                {
                    wifi_first=1;
                    //心跳检测，向涂鸦模块发送
                    err = R_SCI_UART_Write(&g_uart0_ctrl, g_tuya_heartbeat1, 8);
                    if(FSP_SUCCESS != err) __BKPT();
                    while(uart_wifi_TX_flag == false){}
                    uart_wifi_TX_flag = false;
                    }
                else
                {
                    //心跳检测，向涂鸦模块发送
                    err = R_SCI_UART_Write(&g_uart0_ctrl, g_tuya_heartbeat2, 8);
                    if(FSP_SUCCESS != err) __BKPT();
                    while(uart_wifi_TX_flag == false){}
                    uart_wifi_TX_flag = false;
                }
            }
            else if(TUYA_wifi_buffer[3]==0x01)//接收模块发送的查询产品信息请求
            {
                printf("[TUYA] <Query Product Information\r\n");
                //接收模块发送的查询产品信息请求，向涂鸦模块发送
                err = R_SCI_UART_Write(&g_uart0_ctrl, g_tuya_product_info, 49);
                if(FSP_SUCCESS != err) __BKPT();
                while(uart_wifi_TX_flag == false){}
                uart_wifi_TX_flag = false;
            }
            else if(TUYA_wifi_buffer[3]==0x02)//查询工作模式
            {
                printf("[TUYA] <Query Work Mode\r\n");
                //查询工作模式，向涂鸦模块发送
                err = R_SCI_UART_Write(&g_uart0_ctrl, g_tuya_query_mode, 8);
                if(FSP_SUCCESS != err) __BKPT();
                while(uart_wifi_TX_flag == false){}
                uart_wifi_TX_flag = false;
            }
            else if(TUYA_wifi_buffer[3]==0x03)//报告设备联网状态
            {
                g_tuya_mode_flag=TUYA_wifi_buffer[6];//联网状态
                printf("[TUYA] <WIFI_MODE=%02X\r\n", TUYA_wifi_buffer[6]);
                //查询工作模式，向涂鸦模块发送
                err = R_SCI_UART_Write(&g_uart0_ctrl, g_tuya_rpt_net, 8);
                if(FSP_SUCCESS != err) __BKPT();
                while(uart_wifi_TX_flag == false){}
                uart_wifi_TX_flag = false;

                if(TUYA_wifi_buffer[6]==0x04)//已连上路由器且连接到云端
                {
                    wifi_Update=1;//wifi跟新标志位
                }
            }
        }
        // 清除数组
        memset(TUYA_wifi_buffer, 0, UART0_LENGTH);
        // 同时把当前有效长度归零
        UART0_TUYA_LENGTH = 0;
    }
}

// 涂鸦数据上传函数：每 2000ms 上传一次电量和温度信息给涂鸦模块
static void tuya_up_data(void)
{
    // 当处于涂鸦工作模式 4（表示允许上传数据）
    if(g_tuya_mode_flag==4)
    {
        // g_tuya_up_data 每加一次表示延时 1ms（由定时器或主循环每 ms 调用此函数）
        if(g_tuya_up_data<2000)
            g_tuya_up_data++;// 计时增加
        else
        {
            g_tuya_up_data=0;// 超过 2000ms，开始上传数据
            /* ---------------- 电量数据上传 ---------------- */
            bat = 87;  // 模拟电量百分比（实际项目中建议从 ADC 获取真实电压）
            g_tuya_dp_bat[13] = bat;     // 将电量值填入数据帧第14字节
            g_tuya_dp_bat[14] = 0;       // 清空校验和
            // 计算校验和（累加前13个字节）
            for(int i=0;i<=13;i++)
                g_tuya_dp_bat[14]+=g_tuya_dp_bat[i];
            // 串口打印电量信息，供调试查看
            printf("[MCU] -> TUYA DP_BAT = %d\r\n",bat);
            // 通过 UART 发送电量数据给涂鸦 Wi-Fi 模块
            err = R_SCI_UART_Write(&g_uart0_ctrl, g_tuya_dp_bat, 15);
            if(FSP_SUCCESS != err) __BKPT();
            while(uart_wifi_TX_flag == false){}
            uart_wifi_TX_flag = false;

