CoreMaker-lab/RA4M2_IOT/RA4M2_IOT_Project9/src/hal_entry.c
            /* ---------------- 温度数据上传 ---------------- */
            int16_t data_raw_temperature;
            double_t temperature_degC;
            /* Read temperature data */
              memset(&data_raw_temperature, 0x00, sizeof(int16_t));// 清空原始数据缓存
              // 读取 LSM6DSV16X 的原始温度数据
              lsm6dsv16x_temperature_raw_get(&dev_ctx, &data_raw_temperature);
              // 将原始 LSB 数据转换为摄氏温度
              temperature_degC = lsm6dsv16x_from_lsb_to_celsius(
                                   data_raw_temperature);
              // 扩大10倍为整数（单位 0.1°C）方便打包进两个字节
              temp_tuya = temperature_degC * 10;

              g_tuya_dp_temp[12] = temp_tuya / 255;  // 高字节
              g_tuya_dp_temp[13] = temp_tuya % 255;  // 低字节

              g_tuya_dp_temp[14] = 0;  // 清空校验和
              // 计算校验和
              for(int i=0;i<=13;i++)
                  g_tuya_dp_temp[14]+=g_tuya_dp_temp[i];
              // 串口打印温度信息
              printf("[MCU] -> TUYA DP_tEMP = %6.2f\r\n",temperature_degC);
              // 通过 UART 发送温度数据给涂鸦模块
              err = R_SCI_UART_Write(&g_uart0_ctrl, g_tuya_dp_temp, 15);
              if(FSP_SUCCESS != err) __BKPT();
              while(uart_wifi_TX_flag == false){}
              uart_wifi_TX_flag = false;

//              printf("Temperature [degC]:%6.2f\r\n", temperature_degC);
        }
    }
}

// OLED 屏幕启动函数：完成初始化、清屏、颜色/方向配置
static void OLED_Start(void)
{
    OLED_Init();              // 初始化 OLED 屏幕（发送初始化命令序列，设置工作模式）
    OLED_Clear();             // 清空显存（OLED_GRAM），并刷新，使屏幕全黑
    OLED_ColorTurn(0);        // 设置显示颜色模式：0 为正常显示，1 为反色显示（黑白反转）
    OLED_DisplayTurn(0);      // 设置显示方向：0 为正常方向，1 为上下翻转显示

    OLED_Clear();//清空 OLED 显存
    OLED_ShowChinese(0,0,0,16,1);//在坐标 (0,0) 显示 Hzk1[0]，即汉字“瑞”，正显
    OLED_ShowChinese(16,0,1,16,1);//在坐标 (16,0) 显示 Hzk1[1]，即汉字“萨”，正显
    OLED_ShowChinese(32,0,2,16,0);//在坐标 (32,0) 显示 Hzk1[2]，即汉字“单”，反色
    OLED_ShowChinese(48,0,3,16,0);//在坐标 (48,0) 显示 Hzk1[3]，即汉字“片”，反色
    OLED_ShowChinese(64,0,4,16,0);//在坐标 (64,0) 显示 Hzk1[4]，即汉字“机”，反色
    OLED_Refresh();//将上述通过 OLED_ShowChinese() 写入 OLED_GRAM[][] 的内容，批量发送到 OLED 屏幕显示。如果没有调用这个函数，屏幕上不会出现任何内容（即写入显存但未更新）。

    OLED_ShowNum(0, 16, 20250615, 8, 16, 1);//在坐标 (0,16) 显示20250615，长度8，字体16，正显
    OLED_ShowString(84, 16, "RA4M2", 16, 1);//在坐标 (84,16) 显示RA4M2，字体16，正显
    OLED_Refresh();// 将 OLED_GRAM 显存内容刷新到 OLED 屏幕上，显示数字和字符串

    OLED_ShowPicture(0, 32, 117, 19, BMP3, 1);                // 在 OLED 屏幕的 (x=0, y=32) 位置显示一张宽 117、高 19 像素的图片 BMP3，正常模式显示
    OLED_Refresh();                                           // 将图片内容从缓冲区刷新到 OLED 屏幕上，真正显示出来
    R_BSP_SoftwareDelay(200, BSP_DELAY_UNITS_MILLISECONDS);  // 延时 200 毫秒
}


static void OLED_switch(void)
{
    if (g_oled_clear)                     // ← 仅当需切屏时进入
    {
        g_oled_clear = 0;                 // 标记已完成清屏
        OLED_Clear();                     // ① 清显存并刷新，黑场一次

        switch (g_oled_page)              // ② 根据当前页写“标签”
        {
            /* ---------- Page-0 : Tuya 模组 ---------- */
            case 0:
                OLED_ShowString(0,  0, (u8 *)"TUYA",       16,1);
                OLED_ShowString(0, 16, (u8 *)"WIFI MODE:", 16,1);
                OLED_ShowString(0, 32, (u8 *)"AP MODE:",   16,1);
                break;

            /* ---------- Page-1 : LSM6DSV16X ---------- */
            case 1:
                OLED_ShowString(0,  0, (u8 *)"MEMS_LSM6DSV16X", 12,1);
                OLED_ShowString(0, 12, (u8 *)"TAP:",   12,1);
                OLED_ShowString(60,12, (u8 *)"TEMP:",  12,1);
                OLED_ShowString(0, 24, (u8 *)"X(mg):", 12,1);
                OLED_ShowString(0, 36, (u8 *)"Y(mg):", 12,1);
                OLED_ShowString(0, 48, (u8 *)"Z(mg):", 12,1);
                break;

            /* ---------- Page-2 : LPS22DF 气压计 ------- */
            case 2:
                OLED_ShowString(0,  0, (u8 *)"MEMS_LPS22DF", 12,1);
                break;
        }
        OLED_Refresh();                   // ③ 推送骨架到屏幕
    }
}

/* ------------ Page-0 : TUYA 模组信息 -------------------------------- */

static void OLED_DrawPage_TUYA(void)
{
    /* ① 管理倒计时 ── 在线时清零；否则每 1 ms 递减 */
    if (g_tuya_mode_flag == 4)                // 4 = 已连云
        g_tuya_ap_mode_num = 0;
    else if (g_tuya_ap_mode_num > 0)
        g_tuya_ap_mode_num--;

    /* ② 100 ms 节流：g_tuya_num 递增至 100 再刷新一次 */
    if (++g_tuya_num >= 100)
    {
        g_tuya_num = 0;

        /* --- 行1: AP/normal --- */
        if (g_tuya_ap_mode_num > 0)           // 倒计时仍在 → AP
            OLED_ShowString(80,16,(u8 *)"AP    ",16,1);
        else                                  // 否则 normal
            OLED_ShowString(80,16,(u8 *)"normal",16,1);

        /* --- 行2: Wi-Fi work-mode 数字标志 --- */
        OLED_ShowNum(80, 32, g_tuya_mode_flag, 1, 16,1);

        OLED_Refresh();                       // 推送局部变更
    }
}

/* ------------ Page-1 : MEMS_LSM6DSV16X -------------------------- */
static void OLED_DrawPage_MEMS(void)
{
    if(g_tuya_num<100)
    g_tuya_num++;
    else
    {
        g_tuya_num=0;
        /* ---------- 1. TAP 状态 ---------- */
        if(up_down==0)
            OLED_ShowString(24, 12, "Normal", 12, 1);//在坐标 (24,12)
        else if(up_down==1)
            OLED_ShowString(24, 12, "Single", 12, 1);//在坐标 (24,12)
        else if(up_down==2)
            OLED_ShowString(24, 12, "Double", 12, 1);//在坐标 (24,12)
        /* ---------- 2. 读取并显示片内温度 ---------- */
        int16_t data_raw_temperature;
        double_t temperature_degC;
        /* Read temperature data */
        memset(&data_raw_temperature, 0x00, sizeof(int16_t));// 清空原始数据缓存
        // 读取 LSM6DSV16X 的原始温度数据
        lsm6dsv16x_temperature_raw_get(&dev_ctx, &data_raw_temperature);
        // 将原始 LSB 数据转换为摄氏温度
        temperature_degC = lsm6dsv16x_from_lsb_to_celsius(
                                 data_raw_temperature);
        OLED_ShowNum  (90, 12,(uint32_t)temperature_degC, 3, 12, 1);// 整数位
        OLED_ShowChar (110, 12, '.',12, 1);
        uint32_t t100 = (uint32_t)(temperature_degC * 100);
        OLED_ShowNum  (116, 12,(uint32_t)t100%100, 2, 12, 1);// 整数位

