CoreMaker-lab/RA4M2_IOT/RA4M2_IOT_Project9/src/hal_entry.c
        /* ---------- 3. 读取并显示 X/Y/Z 加速度 ---------- */
        int16_t data_raw_acceleration[3];
        double_t acceleration_mg[3];
        lsm6dsv16x_acceleration_raw_get(&dev_ctx, data_raw_acceleration);
        acceleration_mg[0] =
                lsm6dsv16x_from_fs8_to_mg(data_raw_acceleration[0]);
        acceleration_mg[1] =
                lsm6dsv16x_from_fs8_to_mg(data_raw_acceleration[1]);
        acceleration_mg[2] =
                lsm6dsv16x_from_fs8_to_mg(data_raw_acceleration[2]);

        if(acceleration_mg[0]<0)
            OLED_ShowChar (36, 24, '-',12, 1);
        else
            OLED_ShowChar (36, 24, '+',12, 1);
        OLED_ShowNum (42, 24,(uint32_t)fabs(acceleration_mg[0]),5,12, 1);
        OLED_ShowChar (72, 24, '.',12, 1);
        t100=(uint32_t)(fabs(acceleration_mg[0])*100);
        OLED_ShowNum (78, 24,(uint32_t)t100%100,2,12, 1);

        if(acceleration_mg[1]<0)
            OLED_ShowChar (36, 36, '-',12, 1);
        else
            OLED_ShowChar (36, 36, '+',12, 1);
        OLED_ShowNum (42, 36,(uint32_t)fabs(acceleration_mg[1]),5,12, 1);
        OLED_ShowChar (72, 36, '.',12, 1);
        t100=(uint32_t)(fabs(acceleration_mg[1])*100);
        OLED_ShowNum (78, 36,(uint32_t)t100%100,2,12, 1);

        if(acceleration_mg[2]<0)
            OLED_ShowChar (36, 48, '-',12, 1);
        else
            OLED_ShowChar (36, 48, '+',12, 1);
        OLED_ShowNum (42, 48,(uint32_t)fabs(acceleration_mg[2]),5,12, 1);
        OLED_ShowChar (72, 48, '.',12, 1);
        t100=(uint32_t)(fabs(acceleration_mg[2])*100);
        OLED_ShowNum (78, 48,(uint32_t)t100%100,2,12, 1);
        OLED_Refresh();
//        printf("Acceleration [mg]:%4.2f\t%4.2f\t%4.2f\r\n",
//                acceleration_mg[0], acceleration_mg[1], acceleration_mg[2]);

    }
}


/*******************************************************************************************************************//**
 * main() is generated by the RA Configuration editor and is used to generate threads if an RTOS is used.  This function
 * is called by main() when no RTOS is used.
 **********************************************************************************************************************/
void hal_entry(void)
{
    /* TODO: add your own code here */

    // 初始化外设（如 UART、I2C、中断引脚、GPIO 等）
    app_peripheral_init();
    // 初始化 LSM6DSV16X 传感器，配置单击/双击 Tap 检测功能
    sensor_lsm6dsv16x_tap_init();
    // 初始化 OLED,保证屏幕点亮且处于默认显示状态
    OLED_Start();
    while (1)
    {

        //切屏完成后不再清屏，保持增量刷新，避免闪烁
        OLED_switch();
        if(g_oled_page==0) /* Page-0 : Tuya 状态页 */
            OLED_DrawPage_TUYA();// 显示 Wi-Fi / AP 配网信息
        else if(g_oled_page==1)/* Page-1 : LSM6DSV16X 状态页 */
            OLED_DrawPage_MEMS();// 显示单/双击、温度、XYZ 加速度

        // 处理 LSM6DSV16X 的 Tap 检测事件（单击/双击），并串口打印
        sensor_lsm6dsv16x_tap_loop();

        // 处理涂鸦协议状态更新（例如心跳、连接状态等）
        tuya_wifi_Update();

        // 检查按键是否触发 Wi-Fi 配网模式（例如长按按键进入配网）
        button_wifi_ap();

        // 解析 UART 接收的涂鸦协议数据帧（如收到APP指令等）
        uart0_tuya();

        // 每 2000ms 上传一次传感器数据（电量、温度）到涂鸦模块
        tuya_up_data();

        // 软件延时 1ms，控制循环节奏（相当于每 1ms 执行一次）
        R_BSP_SoftwareDelay(1, BSP_DELAY_UNITS_MILLISECONDS);
    }
#if BSP_TZ_SECURE_BUILD
    /* Enter non-secure code */
    R_BSP_NonSecureEnter();
#endif
}


/*
 * @brief  Write generic device register (platform dependent)
 *
 * @param  handle    customizable argument. In this examples is used in
 *                   order to select the correct sensor bus handler.
 * @param  reg       register to write
 * @param  bufp      pointer to data to write in register reg
 * @param  len       number of consecutive register to write
 *
 */
static int32_t platform_write(void *handle, uint8_t reg, const uint8_t *bufp,uint16_t len)
{
    R_SCI_I2C_SlaveAddressSet(&g_i2c2_ctrl, 0x6B, I2C_MASTER_ADDR_MODE_7BIT);
    assert(FSP_SUCCESS == err);
    // 创建一个足够大的缓冲区来包含寄存器地址和数据
    uint8_t data[len + 1];
    data[0] = reg; // 将寄存器地址放在数据的开始
    memcpy(&data[1], bufp, len); // 复制数据到缓冲区

    err = R_SCI_I2C_Write(&g_i2c2_ctrl, data, len+1, true);
    assert(FSP_SUCCESS == err);
    /* Since there is nothing else to do, block until Callback triggers*/
    //while ((I2C_MASTER_EVENT_TX_COMPLETE != i2c_event) && timeout_ms)
    while ((I2C_MASTER_EVENT_TX_COMPLETE != i2c_event) && timeout_ms>0)
    {
        R_BSP_SoftwareDelay(1U, BSP_DELAY_UNITS_MICROSECONDS);
        timeout_ms--;
        }
    if (I2C_MASTER_EVENT_ABORTED == i2c_event)
    {
        __BKPT(0);
    }
    /* Read data back from the I2C slave */
    i2c_event = I2C_MASTER_EVENT_ABORTED;
    timeout_ms           = 100000;
    return 0;
}


/*
 * @brief  Read generic device register (platform dependent)
 *
 * @param  handle    customizable argument. In this examples is used in
 *                   order to select the correct sensor bus handler.
 * @param  reg       register to read
 * @param  bufp      pointer to buffer that store the data read
 * @param  len       number of consecutive register to read
 *
 */
static int32_t platform_read(void *handle, uint8_t reg, uint8_t *bufp,uint16_t len)
{
    R_SCI_I2C_SlaveAddressSet(&g_i2c2_ctrl, 0x6B, I2C_MASTER_ADDR_MODE_7BIT);
    assert(FSP_SUCCESS == err);
    err = R_SCI_I2C_Write(&g_i2c2_ctrl, &reg, 1, true);
    assert(FSP_SUCCESS == err);
    /* Since there is nothing else to do, block until Callback triggers*/
    //while ((I2C_MASTER_EVENT_TX_COMPLETE != i2c_event) && timeout_ms)
    while ((I2C_MASTER_EVENT_TX_COMPLETE != i2c_event) && timeout_ms>0)
    {
        R_BSP_SoftwareDelay(1U, BSP_DELAY_UNITS_MICROSECONDS);
        timeout_ms--;
        }
    if (I2C_MASTER_EVENT_ABORTED == i2c_event)
    {
        __BKPT(0);
        }
    /* Read data back from the I2C slave */
    i2c_event = I2C_MASTER_EVENT_ABORTED;
    timeout_ms           = 100000;

    /* Read data from I2C slave */
    err = R_SCI_I2C_Read(&g_i2c2_ctrl, bufp, len, false);
    assert(FSP_SUCCESS == err);
    while ((I2C_MASTER_EVENT_RX_COMPLETE != i2c_event) && timeout_ms)
    {
        R_BSP_SoftwareDelay(1U, BSP_DELAY_UNITS_MILLISECONDS);
        timeout_ms--;
    }
    if (I2C_MASTER_EVENT_ABORTED == i2c_event)
    {
        __BKPT(0);
    }

    i2c_event = I2C_MASTER_EVENT_ABORTED;
    timeout_ms           = 100000;
  return 0;
}


